Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/CATG_old/CATG_old.tmx
Source language: en_us
Languages: de_de

source: 9. The assembly (24) of claim 8, wherein the neck portion (54) surrounds less than 25% of the central retainer passage (46).
de_de: 9. Anordnung (24) nach Anspruch 8, wobei der Halsabschnitt (54) weniger als 25 % des zentralen Haltedurchgangs (46) umgibt.

source: The assembly (24) of claim 8, wherein the neck portion (54) flexibly connects the clip portion (32) and the lock portion (34).
de_de: Anordnung (24) nach Anspruch 8, wobei der Halsabschnitt (54) den Clipabschnitt (32) und den Verriegelungsabschnitt (34) flexibel verbindet.

source: A method of retaining a structure (20) relative to a mounting surface (22), the method comprising:
de_de: Verfahren zum Halten einer Struktur (20) relativ zu einer Befestigungsfläche (22), das Verfahren umfassend:

source: locating a structure (20) relative to a mounting surface (22) with a mounting stud (30) fixed relative to the mounting surface (22) and extending through a stud opening (38) on a flange (26) of the structure (20);
de_de: Anordnen einer Struktur (20) relativ zu einer Befestigungsfläche (22) mit einem Befestigungsbolzen (30), der relativ zu der Befestigungsfläche (22) fixiert ist und sich durch eine Bolzenöffnung (38) an einem Flansch (26) der Struktur (20) erstreckt;

source: moving a retainer assembly (24) about a flexible hinge (28) connected to the structure (20); and
de_de: Bewegen einer Halteanordnung (24) um ein flexibles Scharnier (28) herum, das mit der Struktur (20) verbunden ist, und

source: engaging the mounting stud (30) with a first flexible flange (42) and a second flexible flange on the retainer assembly (24) in a manner that the first flexible flange (42) and the second flexible flange (44) surround in the engaged position the mounting stud (30) wherein a stud opening (50) defined between the first and second flexible flanges (42, 44) extends parallel to a longitudinal axis of the mounting stud (30).
de_de: Eingreifen des Befestigungsbolzens (30) in einen ersten flexiblen Flansch (42) und einen zweiten flexiblen Flansch an der Halteranordnung (24) in einer Weise, dass der erste flexible Flansch (42) und der zweite flexible Flansch (44) in der Eingriffsposition den Befestigungsbolzen (30) umgeben, wobei sich eine Bolzenöffnung (50), die zwischen dem ersten und dem zweiten flexiblen Flansch (42, 44) definiert ist, parallel zu einer Längsachse des Befestigungsbolzens (30) erstreckt.

source: The method of claim 11, including engaging a distal end of the mounting stud (30) with a lock portion (34) of the retainer assembly (24).
de_de: Verfahren nach Anspruch 11, aufweisend Eingreifen eines distalen Endes des Befestigungsbolzens (30) in einen Verriegelungsabschnitt (34) der Halteranordnung (24).

source: The method of claim 12, wherein the first and second flexible flanges (42, 44) are located on a clip portion (32) and the lock portion (34) is connected to the clip portion (32) by a neck portion (54).
de_de: Verfahren nach Anspruch 12, wobei der erste und zweite flexible Flansch (42, 44) an einem Clipabschnitt (32) angeordnet sind und der Verriegelungsabschnitt (34) mit dem Clipabschnitt (32) durch einen Halsabschnitt (54) verbunden ist.

source: The method of claim 13, including a tab (56; 156) located on an opposite side of the lock portion (34) from the first and second flexible flanges (44).
de_de: Verfahren nach Anspruch 13, das eine Lasche (56; 156) aufweist, die sich auf einer dem ersten und zweiten flexiblen Flansch (44) gegenüberliegenden Seite des Verriegelungsabschnitts (34) befindet.

source: The method of claim 12, wherein the lock portion (34) includes a lock ring (52) having an inner surface for engaging the mounting stud (30).
de_de: Verfahren nach Anspruch 12, wobei der Verriegelungsabschnitt (34) einen Verriegelungsring (52) mit einer Innenfläche zum Eingreifen in den Befestigungsbolzen (30) aufweist.

source: The method of claim 11, wherein the retainer assembly (24), the flexible hinge (28), and the structure (20) are a single piece unitary component.
de_de: Verfahren nach Anspruch 11, wobei die Halteranordnung (24), das flexible Scharnier (28) und die Struktur (20) ein einstückiges einheitliches Bauteil sind.

source: Claims
de_de: Patentansprüche

source: 1. A method of processing wireless communication signals for use in radar sensing, comprising:
de_de: 1. Verfahren zur Verarbeitung von Drahtloskommunikationssignalen zur Verwendung bei der Radarerfassung, umfassend:

source: receiving a reflected communication signal (39), wherein the reflected communication signal (39) is a reflection of a sent communication signal (31) comprising a sent preamble part and a sent data payload, reflected off of at least one object (12), wherein the reflected communication signal (39) comprises a corresponding reflected preamble part and a reflected data payload, said method being characterized by further comprising:
de_de: Empfangen eines reflektierten Kommunikationssignals (39), wobei das reflektierte Kommunikationssignal (39) eine Reflexion eines gesendeten Kommunikationssignals (31) ist, das einen gesendeten Präambelteil und einen gesendeten Nutzdatenteil umfasst, die von mindestens einem Objekt (12) reflektiert wird, wobei das reflektierte Kommunikationssignal (39) einen entsprechenden reflektierten Präambelteil und einen reflektierten Nutzdatenteil umfasst, wobei das Verfahren dadurch gekennzeichnet ist, dass es ferner umfasst:

source: determining a first radar ambiguity function for the reflected preamble part of the reflected communication signal (39),
de_de: Bestimmen einer ersten Radarmehrdeutigkeitsfunktion für den reflektierten Präambelteil des reflektierten Kommunikationssignals (39),

source: determining a second radar ambiguity function for the reflected data payload of the reflected communication signal (39),
de_de: Bestimmen einer zweiten Radarmehrdeutigkeitsfunktion für den reflektierten Nutzdatenteil des reflektierten Kommunikationssignals (39),

source: combining the first and the second radar ambiguity functions using a point-wise minimum selection, for obtaining a combined radar ambiguity function.
de_de: Kombinieren der ersten und der zweiten Radarmehrdeutigkeitsfunktion mithilfe einer punktweisen Minimalauswahl zum Erlangen einer kombinierten Radarmehrdeutigkeitsfunktion.

source: 2. The method of claim 1, wherein the wireless communication signal is an orthogonal freuquency-division multiplexing, OFDM, transmission frame having a single-carrier preamble comprising a short training field, STF, and a channel estimation field, CEF, wherein the first radar ambiguity function for the reflected preamble part of the reflected communication signal is determined based on both the STF and the CEF of the single-carrier preamble.
de_de: 2. Verfahren nach Anspruch 1, wobei das Drahtloskommunikationssignal ein orthogonaler Frequenzmultiplex-(OFDM-)Übertragungsrahmen mit einer Einträger-Präambel ist, der ein kurzes Trainingsfeld (STF) und ein Kanalschätzungsfeld (CEF) umfasst, wobei die erste Radarmehrdeutigkeitsfunktion für den reflektierten Präambelteil des reflektierten Kommunikationssignals auf der Grundlage sowohl des STF als auch des CEF der Einträger-Präambel bestimmt wird.

source: 3. The method of claim 1 or 2 wherein the wireless communication signal is an OFDM transmission frame having a plurality of OFDM data transmission blocks, each OFDM data transmission block having a cyclic prefix, CP, wherein, for determining the second radar ambiguity function for the reflected data payload of the reflected communication signal, the cyclic prefix of the reference signal is set to zero.
de_de: 3. Verfahren nach Anspruch 1 oder 2, wobei das Drahtloskommunikationssignal ein OFDM-Übertragungsrahmen mit einer Vielzahl von OFDM-Datenübertragungsblöcken ist, wobei jeder OFDM-Datenübertragungsblock ein zyklisches Präfix CP aufweist, wobei zum Bestimmen der zweiten Radarmehrdeutigkeitsfunktion für den reflektierten Nutzdatenteil des reflektierten Kommunikationssignals das zyklische Präfix des Referenzsignals auf Null gesetzt wird.

source: 4. The method of any one of claims 1 to 3, wherein the squares of the respective absolute values of the first radar ambiguity function and the second radar ambiguity function are subjected to the point-wise minimum selection, for obtaining the combined radar ambiguity function.
de_de: 4. Verfahren nach einem der Ansprüche 1 bis 3, wobei die Quadrate der jeweiligen Absolutwerte der ersten Radarmehrdeutigkeitsfunktion und der zweiten Radarmehrdeutigkeitsfunktion zum Erlangen der kombinierten Radarmehrdeutigkeitsfunktion der punktweisen Minimalauswahl unterzogen werden.

source: 5. The method of any one of the preceding claims, wherein determining the first radar ambiguity function for the reflected preamble part of the reflected communication signal (39) comprises setting the data payload in a delayed and Doppler-shifted copy of the sent communication signal (31) to zero, prior to comparing it with the reflected preamble part of the reflected communication signal (39).
de_de: 5. Verfahren nach einem der vorhergehenden Ansprüche, wobei Bestimmen der ersten Radarmehrdeutigkeitsfunktion für den reflektierten Präambelteil des reflektierten Kommunikationssignals (39) Auf-Null-Setzen des Nutzdatenteils in einer verzögerten und Doppler-verschobenen Kopie des gesendeten Kommunikationssignals (31) umfasst, bevor sie mit dem reflektierten Präambelteil des reflektierten Kommunikationssignals (39) verglichen wird.

source: 6. The method of any one of the preceding claims, wherein determining the second radar ambiguity function for the reflected data payload of the reflected communication signal (39) comprises setting the preamble part in a delayed and Doppler-shifted copy of the sent communication signal (31) to zero, prior to comparing it with the reflected data payload of the reflected communication signal (39).
de_de: 6. Verfahren nach einem der vorhergehenden Ansprüche, wobei Bestimmen der zweiten Radarmehrdeutigkeitsfunktion für den reflektierten Nutzdatenteil des reflektierten Kommunikationssignals (39) Auf-Null-Setzen des Präambelteils in einer verzögerten und Doppler-verschobenen Kopie des gesendeten Kommunikationssignals (31) umfasst, bevor sie mit dem reflektierten Nutzdatenteil des reflektierten Kommunikationssignals (39) verglichen wird.

source: 7. The method of any one of the preceding claims, wherein determining the first and/or the second radar ambiguity function comprises applying a matched filter or a bank of correlators.
de_de: 7. Verfahren nach einem der vorhergehenden Ansprüche, wobei Bestimmen der ersten und/oder der zweiten Radarmehrdeutigkeitsfunktion Anwenden eines angepassten Filters oder einer Korrelatorbank umfasst.

source: 8. The method of any one of the preceding claims, further comprising extracting a delay information and/or a velocity information of the at least one object (12) from the combined radar ambiguity function.
de_de: 8. Verfahren nach einem der vorhergehenden Ansprüche, ferner umfassend Extrahieren einer Verzögerungsinformation und/oder einer Geschwindigkeitsinformation des mindestens einen Objekts (12) aus der kombinierten Radarmehrdeutigkeitsfunktion.

source: 9. The method of any one of the preceding claims, wherein the frequency of the sent communication signal (31) is within a radar frequency range, including a frequency range between 30 GHz and 300 GHz, particularly between 50 and 150 GHz, for instance between 57 GHz and 71 GHz.
de_de: 9. Verfahren nach einem der vorhergehenden Ansprüche, wobei die Frequenz des gesendeten Kommunikationssignals (31) innerhalb eines Radarfrequenzbereichs ist, der einen Frequenzbereich zwischen 30 GHz und 300 GHz, insbesondere zwischen 50 und 150 GHz, beispielsweise zwischen 57 GHz und 71 GHz, einschließt.

source: A computer program product comprising instructions, which, when the program is executed by a processor and/or a control unit of a communication system, cause the processor and/or the control unit to carry out a method of any one of the preceding claims.
de_de: Computerprogrammprodukt, das Anweisungen umfasst, die, wenn das Programm durch einen Prozessor und/oder eine Steuereinheit eines Kommunikationssystems ausgeführt wird, den Prozessor und/oder die Steuereinheit veranlassen, ein Verfahren nach einem der vorhergehenden Ansprüche umzusetzen.

source: A computer-readable storage medium where a computer program according to the preceding claim is stored on.
de_de: Computerlesbares Speichermedium, auf dem das Computerprogramm nach dem vorhergehenden Anspruch gespeichert ist.

source: A receiver (40) for a joint radar and wireless communication, JRC, configured for performing a method of any one of the claims 1 to 9.
de_de: Empfänger (40) für eine gemeinsame Radar- und Drahtloskommunikation (JRC), konfiguriert zum Durchführen eines Verfahrens nach einem der Ansprüche 1 bis 9.

source: The receiver (40) of claim 12, wherein the receiver (40) is co-located to a transmitter (30) configured for sending the communication signal.
de_de: Empfänger (40) nach Anspruch 12, wobei der Empfänger (40) mit einem Transmitter (30) zusammen angeordnet ist, konfiguriert zum Senden des Kommunikationssignals.

source: The receiver (40) of claim 12 or 13, wherein the receiver (40) comprises a low noise amplifier, LNA, and/or a mixer (43) configured for building an intermediate frequency, particularly the same oscillator (41) signal as the transmitter (30).
de_de: Empfänger (40) nach Anspruch 12 oder 13, wobei der Empfänger (40) einen rauscharmen Verstärker (LNA) und/oder einen Mischer (43) aufweist, konfiguriert zum Aufbauen einer Zwischenfrequenz, insbesondere des gleichen Oszillatorsignals (41) wie der Transmitter (30).

source: A communication system (20) comprising a receiver (40) according to any one of the claims 12 to 14 and a corresponding transmitter (30) configured for sending a communication signal.
de_de: Kommunikationssystem (20), umfassend einen Empfänger (40) nach einem der Ansprüche 12 bis 14 und einen entsprechenden Transmitter (30), konfiguriert zum Senden eines Kommunikationssignals.

source: A vehicle (10) comprising a receiver (40) according to any one of the claims 12 to 14 and/or a communication system (20) according to claim 15.
de_de: Fahrzeug (10), umfassend einen Empfänger (40) nach einem der Ansprüche 12 bis 14 und/oder ein Kommunikationssystem (20) nach Anspruch 15.

source: Use of a receiver (40) according to any one of the claims 12 to 14 and/or a communication system (20) according to claim 15 or of a method for both wireless communication and radar sensing according to any one of the claims 1 to 9.
de_de: Verwenden eines Empfängers (40) nach einem der Ansprüche 12 bis 14 und/oder eines Kommunikationssystems (20) nach Anspruch 15 oder eines Verfahrens sowohl zur Drahtloskommunikation als auch zur Radarerfassung nach einem der Ansprüche 1 bis 9.
